package com.naxesa.bodyheat.Tip;

/**
 * Created by Lee young teak on 2016-09-24.
 */

public class TipContent {
    // Contents
    public static final String CONTENT1 = "정상 체온은 사람마다 다르다. 평균 37도 정도를 유지하고 하루 동안에도 체온은 변한다. 아침에 일어날 때가 가장 낮고, 음식을 먹거나, 옷을 많이 입거나, 흥분, 불안하면 체온이 오른다. 심한 운동을 하면 체온이 39.5도까지 오를 수도 있다. 여자의 월경주기에는 약 0.5도 정도 오르고 대부분의 어린이는 어른보다 체온이 높으며 매일의 변화도 더 크다. 영아나 어린이는 조그만 바이러스 감염에도 열이 높게 오르며 열이 높다고 하여 뇌에 손상을 직접 주는 것은 아니다. 그러나 열로 인한 경련이 어린이에서 있을 수 있는데 경련으로 인하여 아이에게 손상을 줄 수 있다.\n\n" +
            "열이란 어린이나 어른이 상태가 안 좋을 때 우선 열이 있는지 확인을 한다. 열 자체는 질환이 아니지만 몸에 무엇이 일어나고 있다는 것을 의미하는 것이다.\n\n" +
            "열은 간단히 고열과 저열로 나눌 수 있는데 고열은 39.5도 이상, 저열은 39도 이하를 말한다. 또한 열이 갑자기 높게 올랐다 내리는 양상을 보이는 것(spiking fever)과 통상의 방법으로 열이 올랐다 내리는 것(cyclic fever)으로 나눌 수 있다. 열에 따라 다음과 같이 구분할 수도 있다.\n\n" +
            "· 낮은 열 (Low-grade fever) : 37.6-38.2도 \n" +
            "· 경미한 열 (Mild fever) : 38.3-38.9도 \n" +
            "· 중등도의 열 (Moderate fever) : 38.9-39.5도 \n" +
            "· 고열 (High fever) : 40도 이상 \n\n" +
            "열이 시작할 때 몸이 체온을 올리기 시작하면 몸은 춥게 느껴지고 열을 내기 위해 떨게 된다. 이 때 몸을 담요로 싸고 열을 가하면 결국 몸은 새로운 set-point에 도달하게 되어 몸은 뜨겁게 느껴진다. 체온이 정상으로 돌아가려고 할 때 땀을 많이 흘리고, 그래서 열을 없애게 된다. \n\n" +
            "열로 인한 경련은 열이 갑자기 빨리 높아질 때 생기는데 아이가 8세 이하라면 열은 아이가 매우 아프지도 않으면서 높을 수 있다. 2-5살의 아이는 감기 같은 것으로도 40도가 될 수 있다. 8세 이상의 아이에서의 열은 성인과 같이 취급한다. 아이의 체온이 너무 높게 (40도 이상) , 너무 빨리 (1시간에 몇 도씩) 오른다면 열로 인한 경련에 대해 걱정해야 한다. \n\n" +
            "고열이 난다고 질환이 심하다는 것은 아니다. 예를 들면 독감은 고열이 나지만 더 위험한 폐렴은 미열이 나거나 열이 없을 수도 있다. 고열이 나면 경련을 하지만 이는 열이 높다고 하여 나는 것보다는 열이 갑자기 오르는 것으로 생긴다.\n\n" +
            "이러한 증상에 대하여 하남서울이비인후과의원 신익순 원장은 “열은 바이러스나 세균 감염에 대한 몸의 반응이다. 어린이가 감기에 걸리는 원인은 바이러스 감염, 인두염, 중이염 등이 있다. 가장 흔한 원인으로는 감염인데 상기도의 감염 즉 감기와 독감이 매우 흔하다. 어떤 영아나 어린이는 정기 예방접종, 즉 DTP, 폐렴백신 접종 후에 열이 나기도 한다. 간혹 어떻게 설명할 수 없는 열이 나고, 3주 이상 38도가 넘고 원인을 모른다면 원인을 모르는 열(Fever of Unknown Origin :FUO)이라고 하며 대개는 숨겨진 감염으로 생긴다.”고 말했다. \n\n" +
            "열을 일으키는 원인\n\n" +
            "· 감염성 질환 (세균과 바이러스에 의한 것으로 감기, 독감, 중이염, 위장염, 급성 기관지염, 비뇨기계통의 감염, 편도염, 인두염, 후두염, 폐렴, 충수염, 결핵, 뇌막염 등) \n" +
            "· 약물 (항생제, 항히스타민제, 바비튜레이트, 고혈압약) \n" +
            "· 환경적 요인 (열사병 및 탈수, 뜨거운 날씨 등) \n" +
            "· 수혈 \n" +
            "· 뇌에 질환 \n" +
            "· 비감염성 질환 (자가면역질환, 암, 류마티스병) \n\n" +
            "그 외에 많은 원인들이 있어 위의 질환이 모든 질병을 나열한 것이 아니다. 더욱이 나이와 성별, 열의 특징 즉 열의 정도, 시간에 따른 변화, 악화요인, 완화 요인, 관련된 증상에 따라 다르다. \n\n" +
            "열의 치료에는 다음과 같은 방법이 있다. \n\n" +
            "· 약물치료는 열의 원인에 대해 치료하는 것으로 항생제, 항 바이러스성 약물을 사용한다. \n" +
            "· 증상을 없애기 위해 해열 진통제를 사용한다. \n" +
            "· 열이 많이 나면 몸에 따뜻한 물로 적신 수건으로 몸을 닦아 주어 피부에서 물이 증발되도록 한다. 그러나 춥지 않도록 한다. \n" +
            "· 열이 나면 먹어야 한다. 물이라도 많이 먹어야 한다. \n" +
            "· 부모들은 열로 인해 경련을 할 지에 대해 걱정을 하지만 열이 오를 때 경련이 생기고 이미 열이 올라 있다면 잘 안 생긴다. \n" +
            "· 옷을 가볍게 입는다. \n" +
            "· 생후 3개월 이상이면 아세타미노펜을 먹고 3개월이 안 되었으면 의사 처방이 없이 약물을 먹이지 않는다. \n" +
            "· 약물로 체온이 내리면 열의 원인을 없앤 것이 아니지만 아이의 상태가 편해진다. \n\n" +
            "신익순 원장은 “열이 생기지 않게 하는 것은 감염에 노출되지 않게 하는 것이다. 가장 효과적인 일은 손을 잘 씻는 것이다. 특히 식사 전에, 화장실을 갔다 와서, 여럿이서 같이 놀고 났을 때, 동물을 만졌을 때 등이다. 비누로 각 손등과 바닥을 잘 씻어야 한다. 다른 방법으로는 예방주사를 제대로 접종하고 애완동물은 피하는 것이 좋다.”고 조언했다.";

    public static final String symtomsName[] = new String[]{"- 고열 -\n", "- 인후통 -\n", "- 감기 -\n", "- 가래 -\n"};

    public static final String goodFoods[] = new String[]{
            "국화와 박하, 계피와 생강은 열을 없애는 성질을 보유하고 있어요. 감기를 치료할 때의 약재로도 쓰이는 만큼 좋은 음식이죠. 감기에 걸렸을 때 때로는 환절기 평소에도 재료를 구비하여 차로 끓여드신다면 감기를 예방하고 약 대신 음식으로도 좋아요.\n",
            "목의 염증을 가라 앉히고 부기를 없애주는 도라지를 섭취해주면 좋아요. 특히 이미 인후통이 진행되는 사항에 섭취하여 주셔도 매우 좋아요. 다른음식으로 생강즙을 꿀과 섞어서 차로 마셔주면 증상을 완화시켜주죠. 유자차도 목의 기침과 편도 부기를 가라앉혀주는데 유용해요.\n",
            "오래된 기침을 앓고 계신분들은 오미자를 차가운 물에 넣고 우려먹으면 매우 좋아요. 하지만 오미자는 몸에 열을 함께 동반하고 있는 상태에서는 피해주세요. 감기 초기 증상으로 면역이 약해져서 기침이 나올시에는 살구씨를 먹는다면 흉부로 체액이 몰리는 것을 풀어주면서 기침을 완화시켜주는데 탁월하죠.\n",
            "노란 가래를 뱉어내게 해주는 효능이 있는 도라지! 도라지를 꿀이나 설탕에 절여서 먹는 것이 좋아요. 도라지는 염증을 회복시켜주며 단것은 통증을 완화시켜주는 역할을 하죠. 가래가 나오진 않고 목에서 그르렁 거리며 막혀 있을 때에는 신맛이 많이나는 덜 익은 귤 껍질을 말려 차로 마시는 것이 좋죠.\n"};
    public static final String badFoods[] = new String[]{
            "몸에 열이 날때는 식욕도 떨어지고 소화력도 좋지 않기 때문에 밀가루 좋류의 음식은 피하고 삼가는 것을 권장해요.\n",
            "목과 식도에 자극을 주는 맵거나 짠 음식은 피하는것이 좋아요. 특히 카페인이 들어간 커피, 목에 자극을 주는 탄산은 더더욱 피하셔야할 음식이에요.\n",
            "기침이 심할때도 마찬가지로 카페인 음식은 피해주세요. 커피는 일시적으로 증상을 완화시켜주는 듯 느끼지만 많이 복용하며녀 산소 흡입량을 증가시켜 결국 더 많은 기침을 유발하죠.\n",
            "홍삼이나 자양강장제와 같은 음식을 섭취하면 가래가 심할때 염증반응을 악화시킬 수 있으니 피하는 것이 좋아요.\n"};

    public static final String startContent = "감기에 걸렸을 때 가장 중요한 것이 바로 휴식입니다. " +
            "대부분 휴식이라하면 하루종일 잠드는 것을 생각하게 되는데요. " +
            "열 나고, 목은 따갑고, 코는 막혀와 숨쉬기도 힘든 상황에서 제대로 쉬지 못합니다. " +
            "거기에 생활리듬이 엉망진창이 되어 감기가 낫고나서도 피로가 후폭풍처럼 밀려오게 됩니다. " +
            "어떻게 해야 감기에 걸렸을 때 편안하게 쉴 수 있을까요?\n";

    public static final String acts[] = new String[]{
            "가습기 틀어놓고 잠들기",
            "자기전 뜨거운 물로 샤워하기",
            "비강스프레이 사용",
            "베개 높여주기",
            "평소에 같은 시간에 잠들기"
    };
    public static final String actContents[] = new String[]{
            "겨울이 되면 공기가 많이 건조해집니다. " +
                    "건조한 공기는 호흡기 점막을 말려서 면역력을 떨어뜨리게 됩니다. " +
                    "가습기를 틀어놓고 잠들면 조금 더 편하게 호흡할 수 있으며 목의 통증을 가라앉힐 수 있습니다.\n",
            "저는 감기에 걸렸을 때 가장 괴로운 상황을 하나 꼽으라면 불안정한 호흡을 말하겠습니다. " +
                    "코가 꽉 막혀 숨을 쉬지 못하거나 목과 코가 너무 건조해 숨쉴때 통증을 느끼는 경우가 있습니다. " +
                    "뜨거운 물로 샤워할 경우 피로를 풀어줌과 동시에 수증기가 건조한 목과 코게 들어가 통증을 완화시켜줍니다.\n",
            "만약 코가 꽉! 막혀 숨을 쉴 수 없는 경우엔 비강스프레이를 사용해주는 것도 좋습니다. " +
                    "하지만 연속 3일 이상 스프레이를 사용하는 것은 오히려 독이 될 수 있다는 점. " +
                    "뜨거운물에 소금 1/4작은술과 베이킹소다 1/4작은술을 섞어주면 " +
                    "집에서도 간편하게 생리식염수를 만들어 코 안을 씻어낼 수도 있습니다.\n",
            "호흡이 불편해서 잠을 이룰 수 없다면 베개를 높여주세요. " +
                    "평소보다 약간 높은 베개를 베면 호흡이 편안해지고 통증도 줄어들게 됩니다.\n",
            "감기에 걸리면 하루종일 잠을 자는 등 평소와 다른 생활을 하게 됩니다. " +
                    "하지만 감기에 걸렸더라도 평소와 같은 스케줄로 활동하는 것이 좋습니다. " +
                    "그래야만 생활리듬이 깨지지 않고 오히려 밤에 푹 잠들 수 있어 컨디션 조절에 좋습니다.\n"
    };
}
